OpenDTEF-v1912/tutorials/verificationAndValidation/turbulentInflow/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fieldAverage;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldAverage1
{
    type                fieldAverage;
    libs                (fieldFunctionObjects);
    writeControl        writeTime;
    timeStart           $/timeStart;

    fields
    (
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
    );
}

// ************************************************************************* //
